GopalSaraf/Practicals/PSDL/include/proc/pic18f56k42.inc
// Register: DMA2CON0
#define DMA2CON0 DMA2CON0
DMA2CON0                                 equ 03BDCh
// bitfield definitions
DMA2CON0_XIP_POSN                        equ 0000h
DMA2CON0_XIP_POSITION                    equ 0000h
DMA2CON0_XIP_SIZE                        equ 0001h
DMA2CON0_XIP_LENGTH                      equ 0001h
DMA2CON0_XIP_MASK                        equ 0001h
DMA2CON0_AIRQEN_POSN                     equ 0002h
DMA2CON0_AIRQEN_POSITION                 equ 0002h
DMA2CON0_AIRQEN_SIZE                     equ 0001h
DMA2CON0_AIRQEN_LENGTH                   equ 0001h
DMA2CON0_AIRQEN_MASK                     equ 0004h
DMA2CON0_DGO_POSN                        equ 0005h
DMA2CON0_DGO_POSITION                    equ 0005h
DMA2CON0_DGO_SIZE                        equ 0001h
DMA2CON0_DGO_LENGTH                      equ 0001h
DMA2CON0_DGO_MASK                        equ 0020h
DMA2CON0_SIRQEN_POSN                     equ 0006h
DMA2CON0_SIRQEN_POSITION                 equ 0006h
DMA2CON0_SIRQEN_SIZE                     equ 0001h
DMA2CON0_SIRQEN_LENGTH                   equ 0001h
DMA2CON0_SIRQEN_MASK                     equ 0040h
DMA2CON0_EN_POSN                         equ 0007h
DMA2CON0_EN_POSITION                     equ 0007h
DMA2CON0_EN_SIZE                         equ 0001h
DMA2CON0_EN_LENGTH                       equ 0001h
DMA2CON0_EN_MASK                         equ 0080h
DMA2CON0_DMA2XIP_POSN                    equ 0000h
DMA2CON0_DMA2XIP_POSITION                equ 0000h
DMA2CON0_DMA2XIP_SIZE                    equ 0001h
DMA2CON0_DMA2XIP_LENGTH                  equ 0001h
DMA2CON0_DMA2XIP_MASK                    equ 0001h
DMA2CON0_DMA2AIRQEN_POSN                 equ 0002h
DMA2CON0_DMA2AIRQEN_POSITION             equ 0002h
DMA2CON0_DMA2AIRQEN_SIZE                 equ 0001h
DMA2CON0_DMA2AIRQEN_LENGTH               equ 0001h
DMA2CON0_DMA2AIRQEN_MASK                 equ 0004h
DMA2CON0_DMA2DGO_POSN                    equ 0005h
DMA2CON0_DMA2DGO_POSITION                equ 0005h
DMA2CON0_DMA2DGO_SIZE                    equ 0001h
DMA2CON0_DMA2DGO_LENGTH                  equ 0001h
DMA2CON0_DMA2DGO_MASK                    equ 0020h
DMA2CON0_DMA2SIRQEN_POSN                 equ 0006h
DMA2CON0_DMA2SIRQEN_POSITION             equ 0006h
DMA2CON0_DMA2SIRQEN_SIZE                 equ 0001h
DMA2CON0_DMA2SIRQEN_LENGTH               equ 0001h
DMA2CON0_DMA2SIRQEN_MASK                 equ 0040h
DMA2CON0_DMA2EN_POSN                     equ 0007h
DMA2CON0_DMA2EN_POSITION                 equ 0007h
DMA2CON0_DMA2EN_SIZE                     equ 0001h
DMA2CON0_DMA2EN_LENGTH                   equ 0001h
DMA2CON0_DMA2EN_MASK                     equ 0080h

// Register: DMA2CON1
#define DMA2CON1 DMA2CON1
DMA2CON1                                 equ 03BDDh
// bitfield definitions
DMA2CON1_SSTP_POSN                       equ 0000h
DMA2CON1_SSTP_POSITION                   equ 0000h
DMA2CON1_SSTP_SIZE                       equ 0001h
DMA2CON1_SSTP_LENGTH                     equ 0001h
DMA2CON1_SSTP_MASK                       equ 0001h
DMA2CON1_SMODE_POSN                      equ 0001h
DMA2CON1_SMODE_POSITION                  equ 0001h
DMA2CON1_SMODE_SIZE                      equ 0002h
DMA2CON1_SMODE_LENGTH                    equ 0002h
DMA2CON1_SMODE_MASK                      equ 0006h
DMA2CON1_SMR_POSN                        equ 0003h
DMA2CON1_SMR_POSITION                    equ 0003h
DMA2CON1_SMR_SIZE                        equ 0002h
DMA2CON1_SMR_LENGTH                      equ 0002h
DMA2CON1_SMR_MASK                        equ 0018h
DMA2CON1_DSTP_POSN                       equ 0005h
DMA2CON1_DSTP_POSITION                   equ 0005h
DMA2CON1_DSTP_SIZE                       equ 0001h
DMA2CON1_DSTP_LENGTH                     equ 0001h
DMA2CON1_DSTP_MASK                       equ 0020h
DMA2CON1_DMODE_POSN                      equ 0006h
DMA2CON1_DMODE_POSITION                  equ 0006h
DMA2CON1_DMODE_SIZE                      equ 0002h
DMA2CON1_DMODE_LENGTH                    equ 0002h
DMA2CON1_DMODE_MASK                      equ 00C0h

// Register: DMA2AIRQ
#define DMA2AIRQ DMA2AIRQ
DMA2AIRQ                                 equ 03BDEh
// bitfield definitions
DMA2AIRQ_AIRQ_POSN                       equ 0000h
DMA2AIRQ_AIRQ_POSITION                   equ 0000h
DMA2AIRQ_AIRQ_SIZE                       equ 0008h
DMA2AIRQ_AIRQ_LENGTH                     equ 0008h
DMA2AIRQ_AIRQ_MASK                       equ 00FFh
DMA2AIRQ_DMA2AIRQ_POSN                   equ 0000h
DMA2AIRQ_DMA2AIRQ_POSITION               equ 0000h
DMA2AIRQ_DMA2AIRQ_SIZE                   equ 0008h
DMA2AIRQ_DMA2AIRQ_LENGTH                 equ 0008h
DMA2AIRQ_DMA2AIRQ_MASK                   equ 00FFh
DMA2AIRQ_AIRQ0_POSN                      equ 0000h
DMA2AIRQ_AIRQ0_POSITION                  equ 0000h
DMA2AIRQ_AIRQ0_SIZE                      equ 0001h
DMA2AIRQ_AIRQ0_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ0_MASK                      equ 0001h
DMA2AIRQ_AIRQ1_POSN                      equ 0001h
DMA2AIRQ_AIRQ1_POSITION                  equ 0001h
DMA2AIRQ_AIRQ1_SIZE                      equ 0001h
DMA2AIRQ_AIRQ1_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ1_MASK                      equ 0002h
DMA2AIRQ_AIRQ2_POSN                      equ 0002h
DMA2AIRQ_AIRQ2_POSITION                  equ 0002h
DMA2AIRQ_AIRQ2_SIZE                      equ 0001h
DMA2AIRQ_AIRQ2_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ2_MASK                      equ 0004h
DMA2AIRQ_AIRQ3_POSN                      equ 0003h
DMA2AIRQ_AIRQ3_POSITION                  equ 0003h
DMA2AIRQ_AIRQ3_SIZE                      equ 0001h
DMA2AIRQ_AIRQ3_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ3_MASK                      equ 0008h
DMA2AIRQ_AIRQ4_POSN                      equ 0004h
DMA2AIRQ_AIRQ4_POSITION                  equ 0004h
DMA2AIRQ_AIRQ4_SIZE                      equ 0001h
DMA2AIRQ_AIRQ4_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ4_MASK                      equ 0010h
DMA2AIRQ_AIRQ5_POSN                      equ 0005h
DMA2AIRQ_AIRQ5_POSITION                  equ 0005h
DMA2AIRQ_AIRQ5_SIZE                      equ 0001h
DMA2AIRQ_AIRQ5_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ5_MASK                      equ 0020h
DMA2AIRQ_AIRQ6_POSN                      equ 0006h
DMA2AIRQ_AIRQ6_POSITION                  equ 0006h
DMA2AIRQ_AIRQ6_SIZE                      equ 0001h
DMA2AIRQ_AIRQ6_LENGTH                    equ 0001h
DMA2AIRQ_AIRQ6_MASK                      equ 0040h
DMA2AIRQ_DMA2AIRQ0_POSN                  equ 0000h
DMA2AIRQ_DMA2AIRQ0_POSITION              equ 0000h
DMA2AIRQ_DMA2AIRQ0_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ0_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ0_MASK                  equ 0001h
DMA2AIRQ_DMA2AIRQ1_POSN                  equ 0001h
DMA2AIRQ_DMA2AIRQ1_POSITION              equ 0001h
DMA2AIRQ_DMA2AIRQ1_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ1_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ1_MASK                  equ 0002h
DMA2AIRQ_DMA2AIRQ2_POSN                  equ 0002h
DMA2AIRQ_DMA2AIRQ2_POSITION              equ 0002h
DMA2AIRQ_DMA2AIRQ2_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ2_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ2_MASK                  equ 0004h
DMA2AIRQ_DMA2AIRQ3_POSN                  equ 0003h
DMA2AIRQ_DMA2AIRQ3_POSITION              equ 0003h
DMA2AIRQ_DMA2AIRQ3_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ3_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ3_MASK                  equ 0008h
DMA2AIRQ_DMA2AIRQ4_POSN                  equ 0004h
DMA2AIRQ_DMA2AIRQ4_POSITION              equ 0004h
DMA2AIRQ_DMA2AIRQ4_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ4_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ4_MASK                  equ 0010h
DMA2AIRQ_DMA2AIRQ5_POSN                  equ 0005h
DMA2AIRQ_DMA2AIRQ5_POSITION              equ 0005h
DMA2AIRQ_DMA2AIRQ5_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ5_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ5_MASK                  equ 0020h
DMA2AIRQ_DMA2AIRQ6_POSN                  equ 0006h
DMA2AIRQ_DMA2AIRQ6_POSITION              equ 0006h
DMA2AIRQ_DMA2AIRQ6_SIZE                  equ 0001h
DMA2AIRQ_DMA2AIRQ6_LENGTH                equ 0001h
DMA2AIRQ_DMA2AIRQ6_MASK                  equ 0040h

// Register: DMA2SIRQ
#define DMA2SIRQ DMA2SIRQ
DMA2SIRQ                                 equ 03BDFh
// bitfield definitions
DMA2SIRQ_SIRQ_POSN                       equ 0000h
DMA2SIRQ_SIRQ_POSITION                   equ 0000h
DMA2SIRQ_SIRQ_SIZE                       equ 0008h
DMA2SIRQ_SIRQ_LENGTH                     equ 0008h
DMA2SIRQ_SIRQ_MASK                       equ 00FFh
DMA2SIRQ_DMA2SIRQ_POSN                   equ 0000h
DMA2SIRQ_DMA2SIRQ_POSITION               equ 0000h
DMA2SIRQ_DMA2SIRQ_SIZE                   equ 0008h
DMA2SIRQ_DMA2SIRQ_LENGTH                 equ 0008h
DMA2SIRQ_DMA2SIRQ_MASK                   equ 00FFh
DMA2SIRQ_SIRQ0_POSN                      equ 0000h
DMA2SIRQ_SIRQ0_POSITION                  equ 0000h
DMA2SIRQ_SIRQ0_SIZE                      equ 0001h
DMA2SIRQ_SIRQ0_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ0_MASK                      equ 0001h
DMA2SIRQ_SIRQ1_POSN                      equ 0001h
DMA2SIRQ_SIRQ1_POSITION                  equ 0001h
DMA2SIRQ_SIRQ1_SIZE                      equ 0001h
DMA2SIRQ_SIRQ1_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ1_MASK                      equ 0002h
DMA2SIRQ_SIRQ2_POSN                      equ 0002h
DMA2SIRQ_SIRQ2_POSITION                  equ 0002h
DMA2SIRQ_SIRQ2_SIZE                      equ 0001h
DMA2SIRQ_SIRQ2_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ2_MASK                      equ 0004h
DMA2SIRQ_SIRQ3_POSN                      equ 0003h
DMA2SIRQ_SIRQ3_POSITION                  equ 0003h
DMA2SIRQ_SIRQ3_SIZE                      equ 0001h
DMA2SIRQ_SIRQ3_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ3_MASK                      equ 0008h
DMA2SIRQ_SIRQ4_POSN                      equ 0004h
DMA2SIRQ_SIRQ4_POSITION                  equ 0004h
DMA2SIRQ_SIRQ4_SIZE                      equ 0001h
DMA2SIRQ_SIRQ4_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ4_MASK                      equ 0010h
DMA2SIRQ_SIRQ5_POSN                      equ 0005h
DMA2SIRQ_SIRQ5_POSITION                  equ 0005h
DMA2SIRQ_SIRQ5_SIZE                      equ 0001h
DMA2SIRQ_SIRQ5_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ5_MASK                      equ 0020h
DMA2SIRQ_SIRQ6_POSN                      equ 0006h
DMA2SIRQ_SIRQ6_POSITION                  equ 0006h
DMA2SIRQ_SIRQ6_SIZE                      equ 0001h
DMA2SIRQ_SIRQ6_LENGTH                    equ 0001h
DMA2SIRQ_SIRQ6_MASK                      equ 0040h
DMA2SIRQ_DMA2SIRQ0_POSN                  equ 0000h
DMA2SIRQ_DMA2SIRQ0_POSITION              equ 0000h
DMA2SIRQ_DMA2SIRQ0_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ0_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ0_MASK                  equ 0001h
DMA2SIRQ_DMA2SIRQ1_POSN                  equ 0001h
DMA2SIRQ_DMA2SIRQ1_POSITION              equ 0001h
DMA2SIRQ_DMA2SIRQ1_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ1_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ1_MASK                  equ 0002h
DMA2SIRQ_DMA2SIRQ2_POSN                  equ 0002h
DMA2SIRQ_DMA2SIRQ2_POSITION              equ 0002h
DMA2SIRQ_DMA2SIRQ2_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ2_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ2_MASK                  equ 0004h
DMA2SIRQ_DMA2SIRQ3_POSN                  equ 0003h
DMA2SIRQ_DMA2SIRQ3_POSITION              equ 0003h
DMA2SIRQ_DMA2SIRQ3_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ3_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ3_MASK                  equ 0008h
DMA2SIRQ_DMA2SIRQ4_POSN                  equ 0004h
DMA2SIRQ_DMA2SIRQ4_POSITION              equ 0004h
DMA2SIRQ_DMA2SIRQ4_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ4_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ4_MASK                  equ 0010h
DMA2SIRQ_DMA2SIRQ5_POSN                  equ 0005h
DMA2SIRQ_DMA2SIRQ5_POSITION              equ 0005h
DMA2SIRQ_DMA2SIRQ5_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ5_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ5_MASK                  equ 0020h
DMA2SIRQ_DMA2SIRQ6_POSN                  equ 0006h
DMA2SIRQ_DMA2SIRQ6_POSITION              equ 0006h
DMA2SIRQ_DMA2SIRQ6_SIZE                  equ 0001h
DMA2SIRQ_DMA2SIRQ6_LENGTH                equ 0001h
DMA2SIRQ_DMA2SIRQ6_MASK                  equ 0040h

// Register: DMA1BUF
#define DMA1BUF DMA1BUF
DMA1BUF                                  equ 03BE9h
// bitfield definitions
DMA1BUF_BUF_POSN                         equ 0000h
DMA1BUF_BUF_POSITION                     equ 0000h
DMA1BUF_BUF_SIZE                         equ 0008h
DMA1BUF_BUF_LENGTH                       equ 0008h
DMA1BUF_BUF_MASK                         equ 00FFh
DMA1BUF_BUF0_POSN                        equ 0000h
DMA1BUF_BUF0_POSITION                    equ 0000h
DMA1BUF_BUF0_SIZE                        equ 0001h
DMA1BUF_BUF0_LENGTH                      equ 0001h
DMA1BUF_BUF0_MASK                        equ 0001h
DMA1BUF_BUF1_POSN                        equ 0001h
DMA1BUF_BUF1_POSITION                    equ 0001h
DMA1BUF_BUF1_SIZE                        equ 0001h
DMA1BUF_BUF1_LENGTH                      equ 0001h
DMA1BUF_BUF1_MASK                        equ 0002h
DMA1BUF_BUF2_POSN                        equ 0002h
DMA1BUF_BUF2_POSITION                    equ 0002h
DMA1BUF_BUF2_SIZE                        equ 0001h
DMA1BUF_BUF2_LENGTH                      equ 0001h
DMA1BUF_BUF2_MASK                        equ 0004h
DMA1BUF_BUF3_POSN                        equ 0003h
DMA1BUF_BUF3_POSITION                    equ 0003h
DMA1BUF_BUF3_SIZE                        equ 0001h
DMA1BUF_BUF3_LENGTH                      equ 0001h
DMA1BUF_BUF3_MASK                        equ 0008h
DMA1BUF_BUF4_POSN                        equ 0004h
DMA1BUF_BUF4_POSITION                    equ 0004h
DMA1BUF_BUF4_SIZE                        equ 0001h
DMA1BUF_BUF4_LENGTH                      equ 0001h
DMA1BUF_BUF4_MASK                        equ 0010h
DMA1BUF_BUF5_POSN                        equ 0005h
DMA1BUF_BUF5_POSITION                    equ 0005h
DMA1BUF_BUF5_SIZE                        equ 0001h
DMA1BUF_BUF5_LENGTH                      equ 0001h
DMA1BUF_BUF5_MASK                        equ 0020h
DMA1BUF_BUF6_POSN                        equ 0006h
DMA1BUF_BUF6_POSITION                    equ 0006h
DMA1BUF_BUF6_SIZE                        equ 0001h
DMA1BUF_BUF6_LENGTH                      equ 0001h
DMA1BUF_BUF6_MASK                        equ 0040h
DMA1BUF_BUF7_POSN                        equ 0007h
DMA1BUF_BUF7_POSITION                    equ 0007h
DMA1BUF_BUF7_SIZE                        equ 0001h
DMA1BUF_BUF7_LENGTH                      equ 0001h
DMA1BUF_BUF7_MASK                        equ 0080h
DMA1BUF_DMA1BUF_POSN                     equ 0000h
DMA1BUF_DMA1BUF_POSITION                 equ 0000h
DMA1BUF_DMA1BUF_SIZE                     equ 0008h
DMA1BUF_DMA1BUF_LENGTH                   equ 0008h
DMA1BUF_DMA1BUF_MASK                     equ 00FFh
DMA1BUF_DMA1BUF0_POSN                    equ 0000h
DMA1BUF_DMA1BUF0_POSITION                equ 0000h
DMA1BUF_DMA1BUF0_SIZE                    equ 0001h
DMA1BUF_DMA1BUF0_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF0_MASK                    equ 0001h
DMA1BUF_DMA1BUF1_POSN                    equ 0001h
DMA1BUF_DMA1BUF1_POSITION                equ 0001h
DMA1BUF_DMA1BUF1_SIZE                    equ 0001h
DMA1BUF_DMA1BUF1_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF1_MASK                    equ 0002h
DMA1BUF_DMA1BUF2_POSN                    equ 0002h
DMA1BUF_DMA1BUF2_POSITION                equ 0002h
DMA1BUF_DMA1BUF2_SIZE                    equ 0001h
DMA1BUF_DMA1BUF2_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF2_MASK                    equ 0004h
DMA1BUF_DMA1BUF3_POSN                    equ 0003h
DMA1BUF_DMA1BUF3_POSITION                equ 0003h
DMA1BUF_DMA1BUF3_SIZE                    equ 0001h
DMA1BUF_DMA1BUF3_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF3_MASK                    equ 0008h
DMA1BUF_DMA1BUF4_POSN                    equ 0004h
DMA1BUF_DMA1BUF4_POSITION                equ 0004h
DMA1BUF_DMA1BUF4_SIZE                    equ 0001h
DMA1BUF_DMA1BUF4_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF4_MASK                    equ 0010h
DMA1BUF_DMA1BUF5_POSN                    equ 0005h
DMA1BUF_DMA1BUF5_POSITION                equ 0005h
DMA1BUF_DMA1BUF5_SIZE                    equ 0001h
DMA1BUF_DMA1BUF5_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF5_MASK                    equ 0020h
DMA1BUF_DMA1BUF6_POSN                    equ 0006h
DMA1BUF_DMA1BUF6_POSITION                equ 0006h
DMA1BUF_DMA1BUF6_SIZE                    equ 0001h
DMA1BUF_DMA1BUF6_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF6_MASK                    equ 0040h
DMA1BUF_DMA1BUF7_POSN                    equ 0007h
DMA1BUF_DMA1BUF7_POSITION                equ 0007h
DMA1BUF_DMA1BUF7_SIZE                    equ 0001h
DMA1BUF_DMA1BUF7_LENGTH                  equ 0001h
DMA1BUF_DMA1BUF7_MASK                    equ 0080h

