GopalSaraf/Practicals/PSDL/include/proc/pic18f56k42.inc
// Register: DMA1SSZH
#define DMA1SSZH DMA1SSZH
DMA1SSZH                                 equ 03BF8h
// bitfield definitions
DMA1SSZH_SSZ_POSN                        equ 0000h
DMA1SSZH_SSZ_POSITION                    equ 0000h
DMA1SSZH_SSZ_SIZE                        equ 0004h
DMA1SSZH_SSZ_LENGTH                      equ 0004h
DMA1SSZH_SSZ_MASK                        equ 000Fh
DMA1SSZH_DMA1SSZ_POSN                    equ 0000h
DMA1SSZH_DMA1SSZ_POSITION                equ 0000h
DMA1SSZH_DMA1SSZ_SIZE                    equ 0004h
DMA1SSZH_DMA1SSZ_LENGTH                  equ 0004h
DMA1SSZH_DMA1SSZ_MASK                    equ 000Fh
DMA1SSZH_SSZ8_POSN                       equ 0000h
DMA1SSZH_SSZ8_POSITION                   equ 0000h
DMA1SSZH_SSZ8_SIZE                       equ 0001h
DMA1SSZH_SSZ8_LENGTH                     equ 0001h
DMA1SSZH_SSZ8_MASK                       equ 0001h
DMA1SSZH_SSZ9_POSN                       equ 0001h
DMA1SSZH_SSZ9_POSITION                   equ 0001h
DMA1SSZH_SSZ9_SIZE                       equ 0001h
DMA1SSZH_SSZ9_LENGTH                     equ 0001h
DMA1SSZH_SSZ9_MASK                       equ 0002h
DMA1SSZH_SSZ10_POSN                      equ 0002h
DMA1SSZH_SSZ10_POSITION                  equ 0002h
DMA1SSZH_SSZ10_SIZE                      equ 0001h
DMA1SSZH_SSZ10_LENGTH                    equ 0001h
DMA1SSZH_SSZ10_MASK                      equ 0004h
DMA1SSZH_SSZ11_POSN                      equ 0003h
DMA1SSZH_SSZ11_POSITION                  equ 0003h
DMA1SSZH_SSZ11_SIZE                      equ 0001h
DMA1SSZH_SSZ11_LENGTH                    equ 0001h
DMA1SSZH_SSZ11_MASK                      equ 0008h
DMA1SSZH_DMA1SSZ8_POSN                   equ 0000h
DMA1SSZH_DMA1SSZ8_POSITION               equ 0000h
DMA1SSZH_DMA1SSZ8_SIZE                   equ 0001h
DMA1SSZH_DMA1SSZ8_LENGTH                 equ 0001h
DMA1SSZH_DMA1SSZ8_MASK                   equ 0001h
DMA1SSZH_DMA1SSZ9_POSN                   equ 0001h
DMA1SSZH_DMA1SSZ9_POSITION               equ 0001h
DMA1SSZH_DMA1SSZ9_SIZE                   equ 0001h
DMA1SSZH_DMA1SSZ9_LENGTH                 equ 0001h
DMA1SSZH_DMA1SSZ9_MASK                   equ 0002h
DMA1SSZH_DMA1SSZ10_POSN                  equ 0002h
DMA1SSZH_DMA1SSZ10_POSITION              equ 0002h
DMA1SSZH_DMA1SSZ10_SIZE                  equ 0001h
DMA1SSZH_DMA1SSZ10_LENGTH                equ 0001h
DMA1SSZH_DMA1SSZ10_MASK                  equ 0004h
DMA1SSZH_DMA1SSZ11_POSN                  equ 0003h
DMA1SSZH_DMA1SSZ11_POSITION              equ 0003h
DMA1SSZH_DMA1SSZ11_SIZE                  equ 0001h
DMA1SSZH_DMA1SSZ11_LENGTH                equ 0001h
DMA1SSZH_DMA1SSZ11_MASK                  equ 0008h

// Register: DMA1SSA
#define DMA1SSA DMA1SSA
DMA1SSA                                  equ 03BF9h

// Register: DMA1SSAL
#define DMA1SSAL DMA1SSAL
DMA1SSAL                                 equ 03BF9h
// bitfield definitions
DMA1SSAL_SSA_POSN                        equ 0000h
DMA1SSAL_SSA_POSITION                    equ 0000h
DMA1SSAL_SSA_SIZE                        equ 0008h
DMA1SSAL_SSA_LENGTH                      equ 0008h
DMA1SSAL_SSA_MASK                        equ 00FFh
DMA1SSAL_SSA0_POSN                       equ 0000h
DMA1SSAL_SSA0_POSITION                   equ 0000h
DMA1SSAL_SSA0_SIZE                       equ 0001h
DMA1SSAL_SSA0_LENGTH                     equ 0001h
DMA1SSAL_SSA0_MASK                       equ 0001h
DMA1SSAL_SSA1_POSN                       equ 0001h
DMA1SSAL_SSA1_POSITION                   equ 0001h
DMA1SSAL_SSA1_SIZE                       equ 0001h
DMA1SSAL_SSA1_LENGTH                     equ 0001h
DMA1SSAL_SSA1_MASK                       equ 0002h
DMA1SSAL_SSA2_POSN                       equ 0002h
DMA1SSAL_SSA2_POSITION                   equ 0002h
DMA1SSAL_SSA2_SIZE                       equ 0001h
DMA1SSAL_SSA2_LENGTH                     equ 0001h
DMA1SSAL_SSA2_MASK                       equ 0004h
DMA1SSAL_SSA3_POSN                       equ 0003h
DMA1SSAL_SSA3_POSITION                   equ 0003h
DMA1SSAL_SSA3_SIZE                       equ 0001h
DMA1SSAL_SSA3_LENGTH                     equ 0001h
DMA1SSAL_SSA3_MASK                       equ 0008h
DMA1SSAL_SSA4_POSN                       equ 0004h
DMA1SSAL_SSA4_POSITION                   equ 0004h
DMA1SSAL_SSA4_SIZE                       equ 0001h
DMA1SSAL_SSA4_LENGTH                     equ 0001h
DMA1SSAL_SSA4_MASK                       equ 0010h
DMA1SSAL_SSA5_POSN                       equ 0005h
DMA1SSAL_SSA5_POSITION                   equ 0005h
DMA1SSAL_SSA5_SIZE                       equ 0001h
DMA1SSAL_SSA5_LENGTH                     equ 0001h
DMA1SSAL_SSA5_MASK                       equ 0020h
DMA1SSAL_SSA6_POSN                       equ 0006h
DMA1SSAL_SSA6_POSITION                   equ 0006h
DMA1SSAL_SSA6_SIZE                       equ 0001h
DMA1SSAL_SSA6_LENGTH                     equ 0001h
DMA1SSAL_SSA6_MASK                       equ 0040h
DMA1SSAL_SSA7_POSN                       equ 0007h
DMA1SSAL_SSA7_POSITION                   equ 0007h
DMA1SSAL_SSA7_SIZE                       equ 0001h
DMA1SSAL_SSA7_LENGTH                     equ 0001h
DMA1SSAL_SSA7_MASK                       equ 0080h
DMA1SSAL_DMA1SSA_POSN                    equ 0000h
DMA1SSAL_DMA1SSA_POSITION                equ 0000h
DMA1SSAL_DMA1SSA_SIZE                    equ 0008h
DMA1SSAL_DMA1SSA_LENGTH                  equ 0008h
DMA1SSAL_DMA1SSA_MASK                    equ 00FFh
DMA1SSAL_DMA1SSA0_POSN                   equ 0000h
DMA1SSAL_DMA1SSA0_POSITION               equ 0000h
DMA1SSAL_DMA1SSA0_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA0_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA0_MASK                   equ 0001h
DMA1SSAL_DMA1SSA1_POSN                   equ 0001h
DMA1SSAL_DMA1SSA1_POSITION               equ 0001h
DMA1SSAL_DMA1SSA1_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA1_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA1_MASK                   equ 0002h
DMA1SSAL_DMA1SSA2_POSN                   equ 0002h
DMA1SSAL_DMA1SSA2_POSITION               equ 0002h
DMA1SSAL_DMA1SSA2_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA2_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA2_MASK                   equ 0004h
DMA1SSAL_DMA1SSA3_POSN                   equ 0003h
DMA1SSAL_DMA1SSA3_POSITION               equ 0003h
DMA1SSAL_DMA1SSA3_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA3_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA3_MASK                   equ 0008h
DMA1SSAL_DMA1SSA4_POSN                   equ 0004h
DMA1SSAL_DMA1SSA4_POSITION               equ 0004h
DMA1SSAL_DMA1SSA4_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA4_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA4_MASK                   equ 0010h
DMA1SSAL_DMA1SSA5_POSN                   equ 0005h
DMA1SSAL_DMA1SSA5_POSITION               equ 0005h
DMA1SSAL_DMA1SSA5_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA5_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA5_MASK                   equ 0020h
DMA1SSAL_DMA1SSA6_POSN                   equ 0006h
DMA1SSAL_DMA1SSA6_POSITION               equ 0006h
DMA1SSAL_DMA1SSA6_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA6_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA6_MASK                   equ 0040h
DMA1SSAL_DMA1SSA7_POSN                   equ 0007h
DMA1SSAL_DMA1SSA7_POSITION               equ 0007h
DMA1SSAL_DMA1SSA7_SIZE                   equ 0001h
DMA1SSAL_DMA1SSA7_LENGTH                 equ 0001h
DMA1SSAL_DMA1SSA7_MASK                   equ 0080h

// Register: DMA1SSAH
#define DMA1SSAH DMA1SSAH
DMA1SSAH                                 equ 03BFAh
// bitfield definitions
DMA1SSAH_SSA_POSN                        equ 0000h
DMA1SSAH_SSA_POSITION                    equ 0000h
DMA1SSAH_SSA_SIZE                        equ 0008h
DMA1SSAH_SSA_LENGTH                      equ 0008h
DMA1SSAH_SSA_MASK                        equ 00FFh
DMA1SSAH_SSA8_POSN                       equ 0000h
DMA1SSAH_SSA8_POSITION                   equ 0000h
DMA1SSAH_SSA8_SIZE                       equ 0001h
DMA1SSAH_SSA8_LENGTH                     equ 0001h
DMA1SSAH_SSA8_MASK                       equ 0001h
DMA1SSAH_SSA9_POSN                       equ 0001h
DMA1SSAH_SSA9_POSITION                   equ 0001h
DMA1SSAH_SSA9_SIZE                       equ 0001h
DMA1SSAH_SSA9_LENGTH                     equ 0001h
DMA1SSAH_SSA9_MASK                       equ 0002h
DMA1SSAH_SSA10_POSN                      equ 0002h
DMA1SSAH_SSA10_POSITION                  equ 0002h
DMA1SSAH_SSA10_SIZE                      equ 0001h
DMA1SSAH_SSA10_LENGTH                    equ 0001h
DMA1SSAH_SSA10_MASK                      equ 0004h
DMA1SSAH_SSA11_POSN                      equ 0003h
DMA1SSAH_SSA11_POSITION                  equ 0003h
DMA1SSAH_SSA11_SIZE                      equ 0001h
DMA1SSAH_SSA11_LENGTH                    equ 0001h
DMA1SSAH_SSA11_MASK                      equ 0008h
DMA1SSAH_SSA12_POSN                      equ 0004h
DMA1SSAH_SSA12_POSITION                  equ 0004h
DMA1SSAH_SSA12_SIZE                      equ 0001h
DMA1SSAH_SSA12_LENGTH                    equ 0001h
DMA1SSAH_SSA12_MASK                      equ 0010h
DMA1SSAH_SSA13_POSN                      equ 0005h
DMA1SSAH_SSA13_POSITION                  equ 0005h
DMA1SSAH_SSA13_SIZE                      equ 0001h
DMA1SSAH_SSA13_LENGTH                    equ 0001h
DMA1SSAH_SSA13_MASK                      equ 0020h
DMA1SSAH_SSA14_POSN                      equ 0006h
DMA1SSAH_SSA14_POSITION                  equ 0006h
DMA1SSAH_SSA14_SIZE                      equ 0001h
DMA1SSAH_SSA14_LENGTH                    equ 0001h
DMA1SSAH_SSA14_MASK                      equ 0040h
DMA1SSAH_SSA15_POSN                      equ 0007h
DMA1SSAH_SSA15_POSITION                  equ 0007h
DMA1SSAH_SSA15_SIZE                      equ 0001h
DMA1SSAH_SSA15_LENGTH                    equ 0001h
DMA1SSAH_SSA15_MASK                      equ 0080h
DMA1SSAH_DMA1SSA_POSN                    equ 0000h
DMA1SSAH_DMA1SSA_POSITION                equ 0000h
DMA1SSAH_DMA1SSA_SIZE                    equ 0008h
DMA1SSAH_DMA1SSA_LENGTH                  equ 0008h
DMA1SSAH_DMA1SSA_MASK                    equ 00FFh
DMA1SSAH_DMA1SSA8_POSN                   equ 0000h
DMA1SSAH_DMA1SSA8_POSITION               equ 0000h
DMA1SSAH_DMA1SSA8_SIZE                   equ 0001h
DMA1SSAH_DMA1SSA8_LENGTH                 equ 0001h
DMA1SSAH_DMA1SSA8_MASK                   equ 0001h
DMA1SSAH_DMA1SSA9_POSN                   equ 0001h
DMA1SSAH_DMA1SSA9_POSITION               equ 0001h
DMA1SSAH_DMA1SSA9_SIZE                   equ 0001h
DMA1SSAH_DMA1SSA9_LENGTH                 equ 0001h
DMA1SSAH_DMA1SSA9_MASK                   equ 0002h
DMA1SSAH_DMA1SSA10_POSN                  equ 0002h
DMA1SSAH_DMA1SSA10_POSITION              equ 0002h
DMA1SSAH_DMA1SSA10_SIZE                  equ 0001h
DMA1SSAH_DMA1SSA10_LENGTH                equ 0001h
DMA1SSAH_DMA1SSA10_MASK                  equ 0004h
DMA1SSAH_DMA1SSA11_POSN                  equ 0003h
DMA1SSAH_DMA1SSA11_POSITION              equ 0003h
DMA1SSAH_DMA1SSA11_SIZE                  equ 0001h
DMA1SSAH_DMA1SSA11_LENGTH                equ 0001h
DMA1SSAH_DMA1SSA11_MASK                  equ 0008h
DMA1SSAH_DMA1SSA12_POSN                  equ 0004h
DMA1SSAH_DMA1SSA12_POSITION              equ 0004h
DMA1SSAH_DMA1SSA12_SIZE                  equ 0001h
DMA1SSAH_DMA1SSA12_LENGTH                equ 0001h
DMA1SSAH_DMA1SSA12_MASK                  equ 0010h
DMA1SSAH_DMA1SSA13_POSN                  equ 0005h
DMA1SSAH_DMA1SSA13_POSITION              equ 0005h
DMA1SSAH_DMA1SSA13_SIZE                  equ 0001h
DMA1SSAH_DMA1SSA13_LENGTH                equ 0001h
DMA1SSAH_DMA1SSA13_MASK                  equ 0020h
DMA1SSAH_DMA1SSA14_POSN                  equ 0006h
DMA1SSAH_DMA1SSA14_POSITION              equ 0006h
DMA1SSAH_DMA1SSA14_SIZE                  equ 0001h
DMA1SSAH_DMA1SSA14_LENGTH                equ 0001h
DMA1SSAH_DMA1SSA14_MASK                  equ 0040h
DMA1SSAH_DMA1SSA15_POSN                  equ 0007h
DMA1SSAH_DMA1SSA15_POSITION              equ 0007h
DMA1SSAH_DMA1SSA15_SIZE                  equ 0001h
DMA1SSAH_DMA1SSA15_LENGTH                equ 0001h
DMA1SSAH_DMA1SSA15_MASK                  equ 0080h

// Register: DMA1SSAU
#define DMA1SSAU DMA1SSAU
DMA1SSAU                                 equ 03BFBh
// bitfield definitions
DMA1SSAU_SSA_POSN                        equ 0000h
DMA1SSAU_SSA_POSITION                    equ 0000h
DMA1SSAU_SSA_SIZE                        equ 0006h
DMA1SSAU_SSA_LENGTH                      equ 0006h
DMA1SSAU_SSA_MASK                        equ 003Fh
DMA1SSAU_SSA16_POSN                      equ 0000h
DMA1SSAU_SSA16_POSITION                  equ 0000h
DMA1SSAU_SSA16_SIZE                      equ 0001h
DMA1SSAU_SSA16_LENGTH                    equ 0001h
DMA1SSAU_SSA16_MASK                      equ 0001h
DMA1SSAU_SSA17_POSN                      equ 0001h
DMA1SSAU_SSA17_POSITION                  equ 0001h
DMA1SSAU_SSA17_SIZE                      equ 0001h
DMA1SSAU_SSA17_LENGTH                    equ 0001h
DMA1SSAU_SSA17_MASK                      equ 0002h
DMA1SSAU_SSA18_POSN                      equ 0002h
DMA1SSAU_SSA18_POSITION                  equ 0002h
DMA1SSAU_SSA18_SIZE                      equ 0001h
DMA1SSAU_SSA18_LENGTH                    equ 0001h
DMA1SSAU_SSA18_MASK                      equ 0004h
DMA1SSAU_SSA19_POSN                      equ 0003h
DMA1SSAU_SSA19_POSITION                  equ 0003h
DMA1SSAU_SSA19_SIZE                      equ 0001h
DMA1SSAU_SSA19_LENGTH                    equ 0001h
DMA1SSAU_SSA19_MASK                      equ 0008h
DMA1SSAU_SSA20_POSN                      equ 0004h
DMA1SSAU_SSA20_POSITION                  equ 0004h
DMA1SSAU_SSA20_SIZE                      equ 0001h
DMA1SSAU_SSA20_LENGTH                    equ 0001h
DMA1SSAU_SSA20_MASK                      equ 0010h
DMA1SSAU_SSA21_POSN                      equ 0005h
DMA1SSAU_SSA21_POSITION                  equ 0005h
DMA1SSAU_SSA21_SIZE                      equ 0001h
DMA1SSAU_SSA21_LENGTH                    equ 0001h
DMA1SSAU_SSA21_MASK                      equ 0020h
DMA1SSAU_DMA1SSA_POSN                    equ 0000h
DMA1SSAU_DMA1SSA_POSITION                equ 0000h
DMA1SSAU_DMA1SSA_SIZE                    equ 0006h
DMA1SSAU_DMA1SSA_LENGTH                  equ 0006h
DMA1SSAU_DMA1SSA_MASK                    equ 003Fh
DMA1SSAU_DMA1SSA16_POSN                  equ 0000h
DMA1SSAU_DMA1SSA16_POSITION              equ 0000h
DMA1SSAU_DMA1SSA16_SIZE                  equ 0001h
DMA1SSAU_DMA1SSA16_LENGTH                equ 0001h
DMA1SSAU_DMA1SSA16_MASK                  equ 0001h
DMA1SSAU_DMA1SSA17_POSN                  equ 0001h
DMA1SSAU_DMA1SSA17_POSITION              equ 0001h
DMA1SSAU_DMA1SSA17_SIZE                  equ 0001h
DMA1SSAU_DMA1SSA17_LENGTH                equ 0001h
DMA1SSAU_DMA1SSA17_MASK                  equ 0002h
DMA1SSAU_DMA1SSA18_POSN                  equ 0002h
DMA1SSAU_DMA1SSA18_POSITION              equ 0002h
DMA1SSAU_DMA1SSA18_SIZE                  equ 0001h
DMA1SSAU_DMA1SSA18_LENGTH                equ 0001h
DMA1SSAU_DMA1SSA18_MASK                  equ 0004h
DMA1SSAU_DMA1SSA19_POSN                  equ 0003h
DMA1SSAU_DMA1SSA19_POSITION              equ 0003h
DMA1SSAU_DMA1SSA19_SIZE                  equ 0001h
DMA1SSAU_DMA1SSA19_LENGTH                equ 0001h
DMA1SSAU_DMA1SSA19_MASK                  equ 0008h
DMA1SSAU_DMA1SSA20_POSN                  equ 0004h
DMA1SSAU_DMA1SSA20_POSITION              equ 0004h
DMA1SSAU_DMA1SSA20_SIZE                  equ 0001h
DMA1SSAU_DMA1SSA20_LENGTH                equ 0001h
DMA1SSAU_DMA1SSA20_MASK                  equ 0010h
DMA1SSAU_DMA1SSA21_POSN                  equ 0005h
DMA1SSAU_DMA1SSA21_POSITION              equ 0005h
DMA1SSAU_DMA1SSA21_SIZE                  equ 0001h
DMA1SSAU_DMA1SSA21_LENGTH                equ 0001h
DMA1SSAU_DMA1SSA21_MASK                  equ 0020h

