GopalSaraf/Practicals/PSDL/include/proc/pic18f56k42.inc
// Register: CWG3CON0
#define CWG3CON0 CWG3CON0
CWG3CON0                                 equ 03F44h
// bitfield definitions
CWG3CON0_MODE_POSN                       equ 0000h
CWG3CON0_MODE_POSITION                   equ 0000h
CWG3CON0_MODE_SIZE                       equ 0003h
CWG3CON0_MODE_LENGTH                     equ 0003h
CWG3CON0_MODE_MASK                       equ 0007h
CWG3CON0_LD_POSN                         equ 0006h
CWG3CON0_LD_POSITION                     equ 0006h
CWG3CON0_LD_SIZE                         equ 0001h
CWG3CON0_LD_LENGTH                       equ 0001h
CWG3CON0_LD_MASK                         equ 0040h
CWG3CON0_EN_POSN                         equ 0007h
CWG3CON0_EN_POSITION                     equ 0007h
CWG3CON0_EN_SIZE                         equ 0001h
CWG3CON0_EN_LENGTH                       equ 0001h
CWG3CON0_EN_MASK                         equ 0080h
CWG3CON0_MODE0_POSN                      equ 0000h
CWG3CON0_MODE0_POSITION                  equ 0000h
CWG3CON0_MODE0_SIZE                      equ 0001h
CWG3CON0_MODE0_LENGTH                    equ 0001h
CWG3CON0_MODE0_MASK                      equ 0001h
CWG3CON0_MODE1_POSN                      equ 0001h
CWG3CON0_MODE1_POSITION                  equ 0001h
CWG3CON0_MODE1_SIZE                      equ 0001h
CWG3CON0_MODE1_LENGTH                    equ 0001h
CWG3CON0_MODE1_MASK                      equ 0002h
CWG3CON0_MODE2_POSN                      equ 0002h
CWG3CON0_MODE2_POSITION                  equ 0002h
CWG3CON0_MODE2_SIZE                      equ 0001h
CWG3CON0_MODE2_LENGTH                    equ 0001h
CWG3CON0_MODE2_MASK                      equ 0004h
CWG3CON0_G3EN_POSN                       equ 0007h
CWG3CON0_G3EN_POSITION                   equ 0007h
CWG3CON0_G3EN_SIZE                       equ 0001h
CWG3CON0_G3EN_LENGTH                     equ 0001h
CWG3CON0_G3EN_MASK                       equ 0080h
CWG3CON0_CWG3MODE_POSN                   equ 0000h
CWG3CON0_CWG3MODE_POSITION               equ 0000h
CWG3CON0_CWG3MODE_SIZE                   equ 0003h
CWG3CON0_CWG3MODE_LENGTH                 equ 0003h
CWG3CON0_CWG3MODE_MASK                   equ 0007h
CWG3CON0_CWG3LD_POSN                     equ 0006h
CWG3CON0_CWG3LD_POSITION                 equ 0006h
CWG3CON0_CWG3LD_SIZE                     equ 0001h
CWG3CON0_CWG3LD_LENGTH                   equ 0001h
CWG3CON0_CWG3LD_MASK                     equ 0040h
CWG3CON0_CWG3EN_POSN                     equ 0007h
CWG3CON0_CWG3EN_POSITION                 equ 0007h
CWG3CON0_CWG3EN_SIZE                     equ 0001h
CWG3CON0_CWG3EN_LENGTH                   equ 0001h
CWG3CON0_CWG3EN_MASK                     equ 0080h
CWG3CON0_CWG3MODE0_POSN                  equ 0000h
CWG3CON0_CWG3MODE0_POSITION              equ 0000h
CWG3CON0_CWG3MODE0_SIZE                  equ 0001h
CWG3CON0_CWG3MODE0_LENGTH                equ 0001h
CWG3CON0_CWG3MODE0_MASK                  equ 0001h
CWG3CON0_CWG3MODE1_POSN                  equ 0001h
CWG3CON0_CWG3MODE1_POSITION              equ 0001h
CWG3CON0_CWG3MODE1_SIZE                  equ 0001h
CWG3CON0_CWG3MODE1_LENGTH                equ 0001h
CWG3CON0_CWG3MODE1_MASK                  equ 0002h
CWG3CON0_CWG3MODE2_POSN                  equ 0002h
CWG3CON0_CWG3MODE2_POSITION              equ 0002h
CWG3CON0_CWG3MODE2_SIZE                  equ 0001h
CWG3CON0_CWG3MODE2_LENGTH                equ 0001h
CWG3CON0_CWG3MODE2_MASK                  equ 0004h

// Register: CWG3CON1
#define CWG3CON1 CWG3CON1
CWG3CON1                                 equ 03F45h
// bitfield definitions
CWG3CON1_POLA_POSN                       equ 0000h
CWG3CON1_POLA_POSITION                   equ 0000h
CWG3CON1_POLA_SIZE                       equ 0001h
CWG3CON1_POLA_LENGTH                     equ 0001h
CWG3CON1_POLA_MASK                       equ 0001h
CWG3CON1_POLB_POSN                       equ 0001h
CWG3CON1_POLB_POSITION                   equ 0001h
CWG3CON1_POLB_SIZE                       equ 0001h
CWG3CON1_POLB_LENGTH                     equ 0001h
CWG3CON1_POLB_MASK                       equ 0002h
CWG3CON1_POLC_POSN                       equ 0002h
CWG3CON1_POLC_POSITION                   equ 0002h
CWG3CON1_POLC_SIZE                       equ 0001h
CWG3CON1_POLC_LENGTH                     equ 0001h
CWG3CON1_POLC_MASK                       equ 0004h
CWG3CON1_POLD_POSN                       equ 0003h
CWG3CON1_POLD_POSITION                   equ 0003h
CWG3CON1_POLD_SIZE                       equ 0001h
CWG3CON1_POLD_LENGTH                     equ 0001h
CWG3CON1_POLD_MASK                       equ 0008h
CWG3CON1_IN_POSN                         equ 0005h
CWG3CON1_IN_POSITION                     equ 0005h
CWG3CON1_IN_SIZE                         equ 0001h
CWG3CON1_IN_LENGTH                       equ 0001h
CWG3CON1_IN_MASK                         equ 0020h
CWG3CON1_CWG3POLA_POSN                   equ 0000h
CWG3CON1_CWG3POLA_POSITION               equ 0000h
CWG3CON1_CWG3POLA_SIZE                   equ 0001h
CWG3CON1_CWG3POLA_LENGTH                 equ 0001h
CWG3CON1_CWG3POLA_MASK                   equ 0001h
CWG3CON1_CWG3POLB_POSN                   equ 0001h
CWG3CON1_CWG3POLB_POSITION               equ 0001h
CWG3CON1_CWG3POLB_SIZE                   equ 0001h
CWG3CON1_CWG3POLB_LENGTH                 equ 0001h
CWG3CON1_CWG3POLB_MASK                   equ 0002h
CWG3CON1_CWG3POLC_POSN                   equ 0002h
CWG3CON1_CWG3POLC_POSITION               equ 0002h
CWG3CON1_CWG3POLC_SIZE                   equ 0001h
CWG3CON1_CWG3POLC_LENGTH                 equ 0001h
CWG3CON1_CWG3POLC_MASK                   equ 0004h
CWG3CON1_CWG3POLD_POSN                   equ 0003h
CWG3CON1_CWG3POLD_POSITION               equ 0003h
CWG3CON1_CWG3POLD_SIZE                   equ 0001h
CWG3CON1_CWG3POLD_LENGTH                 equ 0001h
CWG3CON1_CWG3POLD_MASK                   equ 0008h
CWG3CON1_CWG3IN_POSN                     equ 0005h
CWG3CON1_CWG3IN_POSITION                 equ 0005h
CWG3CON1_CWG3IN_SIZE                     equ 0001h
CWG3CON1_CWG3IN_LENGTH                   equ 0001h
CWG3CON1_CWG3IN_MASK                     equ 0020h

// Register: CWG3AS0
#define CWG3AS0 CWG3AS0
CWG3AS0                                  equ 03F46h
// bitfield definitions
CWG3AS0_LSAC_POSN                        equ 0002h
CWG3AS0_LSAC_POSITION                    equ 0002h
CWG3AS0_LSAC_SIZE                        equ 0002h
CWG3AS0_LSAC_LENGTH                      equ 0002h
CWG3AS0_LSAC_MASK                        equ 000Ch
CWG3AS0_LSDBD_POSN                       equ 0004h
CWG3AS0_LSDBD_POSITION                   equ 0004h
CWG3AS0_LSDBD_SIZE                       equ 0002h
CWG3AS0_LSDBD_LENGTH                     equ 0002h
CWG3AS0_LSDBD_MASK                       equ 0030h
CWG3AS0_REN_POSN                         equ 0006h
CWG3AS0_REN_POSITION                     equ 0006h
CWG3AS0_REN_SIZE                         equ 0001h
CWG3AS0_REN_LENGTH                       equ 0001h
CWG3AS0_REN_MASK                         equ 0040h
CWG3AS0_SHUTDOWN_POSN                    equ 0007h
CWG3AS0_SHUTDOWN_POSITION                equ 0007h
CWG3AS0_SHUTDOWN_SIZE                    equ 0001h
CWG3AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG3AS0_SHUTDOWN_MASK                    equ 0080h
CWG3AS0_LSAC0_POSN                       equ 0002h
CWG3AS0_LSAC0_POSITION                   equ 0002h
CWG3AS0_LSAC0_SIZE                       equ 0001h
CWG3AS0_LSAC0_LENGTH                     equ 0001h
CWG3AS0_LSAC0_MASK                       equ 0004h
CWG3AS0_LSCA1_POSN                       equ 0003h
CWG3AS0_LSCA1_POSITION                   equ 0003h
CWG3AS0_LSCA1_SIZE                       equ 0001h
CWG3AS0_LSCA1_LENGTH                     equ 0001h
CWG3AS0_LSCA1_MASK                       equ 0008h
CWG3AS0_LSDB0_POSN                       equ 0004h
CWG3AS0_LSDB0_POSITION                   equ 0004h
CWG3AS0_LSDB0_SIZE                       equ 0001h
CWG3AS0_LSDB0_LENGTH                     equ 0001h
CWG3AS0_LSDB0_MASK                       equ 0010h
CWG3AS0_LSDB1_POSN                       equ 0005h
CWG3AS0_LSDB1_POSITION                   equ 0005h
CWG3AS0_LSDB1_SIZE                       equ 0001h
CWG3AS0_LSDB1_LENGTH                     equ 0001h
CWG3AS0_LSDB1_MASK                       equ 0020h
CWG3AS0_CWG3LSAC0_POSN                   equ 0002h
CWG3AS0_CWG3LSAC0_POSITION               equ 0002h
CWG3AS0_CWG3LSAC0_SIZE                   equ 0001h
CWG3AS0_CWG3LSAC0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSAC0_MASK                   equ 0004h
CWG3AS0_CWG3LSAC1_POSN                   equ 0003h
CWG3AS0_CWG3LSAC1_POSITION               equ 0003h
CWG3AS0_CWG3LSAC1_SIZE                   equ 0001h
CWG3AS0_CWG3LSAC1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSAC1_MASK                   equ 0008h
CWG3AS0_CWG3LSDB0_POSN                   equ 0004h
CWG3AS0_CWG3LSDB0_POSITION               equ 0004h
CWG3AS0_CWG3LSDB0_SIZE                   equ 0001h
CWG3AS0_CWG3LSDB0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSDB0_MASK                   equ 0010h
CWG3AS0_CWG3LSDB1_POSN                   equ 0005h
CWG3AS0_CWG3LSDB1_POSITION               equ 0005h
CWG3AS0_CWG3LSDB1_SIZE                   equ 0001h
CWG3AS0_CWG3LSDB1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSDB1_MASK                   equ 0020h
CWG3AS0_CWG3LSAC_POSN                    equ 0002h
CWG3AS0_CWG3LSAC_POSITION                equ 0002h
CWG3AS0_CWG3LSAC_SIZE                    equ 0002h
CWG3AS0_CWG3LSAC_LENGTH                  equ 0002h
CWG3AS0_CWG3LSAC_MASK                    equ 000Ch
CWG3AS0_CWG3LSDB_POSN                    equ 0004h
CWG3AS0_CWG3LSDB_POSITION                equ 0004h
CWG3AS0_CWG3LSDB_SIZE                    equ 0002h
CWG3AS0_CWG3LSDB_LENGTH                  equ 0002h
CWG3AS0_CWG3LSDB_MASK                    equ 0030h
CWG3AS0_LSBD_POSN                        equ 0004h
CWG3AS0_LSBD_POSITION                    equ 0004h
CWG3AS0_LSBD_SIZE                        equ 0002h
CWG3AS0_LSBD_LENGTH                      equ 0002h
CWG3AS0_LSBD_MASK                        equ 0030h
CWG3AS0_LSAC1_POSN                       equ 0003h
CWG3AS0_LSAC1_POSITION                   equ 0003h
CWG3AS0_LSAC1_SIZE                       equ 0001h
CWG3AS0_LSAC1_LENGTH                     equ 0001h
CWG3AS0_LSAC1_MASK                       equ 0008h
CWG3AS0_LSBD0_POSN                       equ 0004h
CWG3AS0_LSBD0_POSITION                   equ 0004h
CWG3AS0_LSBD0_SIZE                       equ 0001h
CWG3AS0_LSBD0_LENGTH                     equ 0001h
CWG3AS0_LSBD0_MASK                       equ 0010h
CWG3AS0_LSBD1_POSN                       equ 0005h
CWG3AS0_LSBD1_POSITION                   equ 0005h
CWG3AS0_LSBD1_SIZE                       equ 0001h
CWG3AS0_LSBD1_LENGTH                     equ 0001h
CWG3AS0_LSBD1_MASK                       equ 0020h
CWG3AS0_CWG3LSBD0_POSN                   equ 0004h
CWG3AS0_CWG3LSBD0_POSITION               equ 0004h
CWG3AS0_CWG3LSBD0_SIZE                   equ 0001h
CWG3AS0_CWG3LSBD0_LENGTH                 equ 0001h
CWG3AS0_CWG3LSBD0_MASK                   equ 0010h
CWG3AS0_CWG3LSBD1_POSN                   equ 0005h
CWG3AS0_CWG3LSBD1_POSITION               equ 0005h
CWG3AS0_CWG3LSBD1_SIZE                   equ 0001h
CWG3AS0_CWG3LSBD1_LENGTH                 equ 0001h
CWG3AS0_CWG3LSBD1_MASK                   equ 0020h
CWG3AS0_CWG3LSBD_POSN                    equ 0004h
CWG3AS0_CWG3LSBD_POSITION                equ 0004h
CWG3AS0_CWG3LSBD_SIZE                    equ 0002h
CWG3AS0_CWG3LSBD_LENGTH                  equ 0002h
CWG3AS0_CWG3LSBD_MASK                    equ 0030h

// Register: CWG3AS1
#define CWG3AS1 CWG3AS1
CWG3AS1                                  equ 03F47h
// bitfield definitions
CWG3AS1_AS0E_POSN                        equ 0000h
CWG3AS1_AS0E_POSITION                    equ 0000h
CWG3AS1_AS0E_SIZE                        equ 0001h
CWG3AS1_AS0E_LENGTH                      equ 0001h
CWG3AS1_AS0E_MASK                        equ 0001h
CWG3AS1_AS1E_POSN                        equ 0001h
CWG3AS1_AS1E_POSITION                    equ 0001h
CWG3AS1_AS1E_SIZE                        equ 0001h
CWG3AS1_AS1E_LENGTH                      equ 0001h
CWG3AS1_AS1E_MASK                        equ 0002h
CWG3AS1_AS2E_POSN                        equ 0002h
CWG3AS1_AS2E_POSITION                    equ 0002h
CWG3AS1_AS2E_SIZE                        equ 0001h
CWG3AS1_AS2E_LENGTH                      equ 0001h
CWG3AS1_AS2E_MASK                        equ 0004h
CWG3AS1_AS3E_POSN                        equ 0003h
CWG3AS1_AS3E_POSITION                    equ 0003h
CWG3AS1_AS3E_SIZE                        equ 0001h
CWG3AS1_AS3E_LENGTH                      equ 0001h
CWG3AS1_AS3E_MASK                        equ 0008h
CWG3AS1_AS4E_POSN                        equ 0004h
CWG3AS1_AS4E_POSITION                    equ 0004h
CWG3AS1_AS4E_SIZE                        equ 0001h
CWG3AS1_AS4E_LENGTH                      equ 0001h
CWG3AS1_AS4E_MASK                        equ 0010h
CWG3AS1_AS5E_POSN                        equ 0005h
CWG3AS1_AS5E_POSITION                    equ 0005h
CWG3AS1_AS5E_SIZE                        equ 0001h
CWG3AS1_AS5E_LENGTH                      equ 0001h
CWG3AS1_AS5E_MASK                        equ 0020h
CWG3AS1_AS6E_POSN                        equ 0006h
CWG3AS1_AS6E_POSITION                    equ 0006h
CWG3AS1_AS6E_SIZE                        equ 0001h
CWG3AS1_AS6E_LENGTH                      equ 0001h
CWG3AS1_AS6E_MASK                        equ 0040h

// Register: CWG3STR
#define CWG3STR CWG3STR
CWG3STR                                  equ 03F48h
// bitfield definitions
CWG3STR_STRA_POSN                        equ 0000h
CWG3STR_STRA_POSITION                    equ 0000h
CWG3STR_STRA_SIZE                        equ 0001h
CWG3STR_STRA_LENGTH                      equ 0001h
CWG3STR_STRA_MASK                        equ 0001h
CWG3STR_STRB_POSN                        equ 0001h
CWG3STR_STRB_POSITION                    equ 0001h
CWG3STR_STRB_SIZE                        equ 0001h
CWG3STR_STRB_LENGTH                      equ 0001h
CWG3STR_STRB_MASK                        equ 0002h
CWG3STR_STRC_POSN                        equ 0002h
CWG3STR_STRC_POSITION                    equ 0002h
CWG3STR_STRC_SIZE                        equ 0001h
CWG3STR_STRC_LENGTH                      equ 0001h
CWG3STR_STRC_MASK                        equ 0004h
CWG3STR_STRD_POSN                        equ 0003h
CWG3STR_STRD_POSITION                    equ 0003h
CWG3STR_STRD_SIZE                        equ 0001h
CWG3STR_STRD_LENGTH                      equ 0001h
CWG3STR_STRD_MASK                        equ 0008h
CWG3STR_OVRA_POSN                        equ 0004h
CWG3STR_OVRA_POSITION                    equ 0004h
CWG3STR_OVRA_SIZE                        equ 0001h
CWG3STR_OVRA_LENGTH                      equ 0001h
CWG3STR_OVRA_MASK                        equ 0010h
CWG3STR_OVRB_POSN                        equ 0005h
CWG3STR_OVRB_POSITION                    equ 0005h
CWG3STR_OVRB_SIZE                        equ 0001h
CWG3STR_OVRB_LENGTH                      equ 0001h
CWG3STR_OVRB_MASK                        equ 0020h
CWG3STR_OVRC_POSN                        equ 0006h
CWG3STR_OVRC_POSITION                    equ 0006h
CWG3STR_OVRC_SIZE                        equ 0001h
CWG3STR_OVRC_LENGTH                      equ 0001h
CWG3STR_OVRC_MASK                        equ 0040h
CWG3STR_OVRD_POSN                        equ 0007h
CWG3STR_OVRD_POSITION                    equ 0007h
CWG3STR_OVRD_SIZE                        equ 0001h
CWG3STR_OVRD_LENGTH                      equ 0001h
CWG3STR_OVRD_MASK                        equ 0080h
CWG3STR_CWG3STRA_POSN                    equ 0000h
CWG3STR_CWG3STRA_POSITION                equ 0000h
CWG3STR_CWG3STRA_SIZE                    equ 0001h
CWG3STR_CWG3STRA_LENGTH                  equ 0001h
CWG3STR_CWG3STRA_MASK                    equ 0001h
CWG3STR_CWG3STRB_POSN                    equ 0001h
CWG3STR_CWG3STRB_POSITION                equ 0001h
CWG3STR_CWG3STRB_SIZE                    equ 0001h
CWG3STR_CWG3STRB_LENGTH                  equ 0001h
CWG3STR_CWG3STRB_MASK                    equ 0002h
CWG3STR_CWG3STRC_POSN                    equ 0002h
CWG3STR_CWG3STRC_POSITION                equ 0002h
CWG3STR_CWG3STRC_SIZE                    equ 0001h
CWG3STR_CWG3STRC_LENGTH                  equ 0001h
CWG3STR_CWG3STRC_MASK                    equ 0004h
CWG3STR_CWG3STRD_POSN                    equ 0003h
CWG3STR_CWG3STRD_POSITION                equ 0003h
CWG3STR_CWG3STRD_SIZE                    equ 0001h
CWG3STR_CWG3STRD_LENGTH                  equ 0001h
CWG3STR_CWG3STRD_MASK                    equ 0008h
CWG3STR_CWG3OVRA_POSN                    equ 0004h
CWG3STR_CWG3OVRA_POSITION                equ 0004h
CWG3STR_CWG3OVRA_SIZE                    equ 0001h
CWG3STR_CWG3OVRA_LENGTH                  equ 0001h
CWG3STR_CWG3OVRA_MASK                    equ 0010h
CWG3STR_CWG3OVRB_POSN                    equ 0005h
CWG3STR_CWG3OVRB_POSITION                equ 0005h
CWG3STR_CWG3OVRB_SIZE                    equ 0001h
CWG3STR_CWG3OVRB_LENGTH                  equ 0001h
CWG3STR_CWG3OVRB_MASK                    equ 0020h
CWG3STR_CWG3OVRC_POSN                    equ 0006h
CWG3STR_CWG3OVRC_POSITION                equ 0006h
CWG3STR_CWG3OVRC_SIZE                    equ 0001h
CWG3STR_CWG3OVRC_LENGTH                  equ 0001h
CWG3STR_CWG3OVRC_MASK                    equ 0040h
CWG3STR_CWG3OVRD_POSN                    equ 0007h
CWG3STR_CWG3OVRD_POSITION                equ 0007h
CWG3STR_CWG3OVRD_SIZE                    equ 0001h
CWG3STR_CWG3OVRD_LENGTH                  equ 0001h
CWG3STR_CWG3OVRD_MASK                    equ 0080h

// Register: CWG2CLK
#define CWG2CLK CWG2CLK
CWG2CLK                                  equ 03F49h
// bitfield definitions
CWG2CLK_CS_POSN                          equ 0000h
CWG2CLK_CS_POSITION                      equ 0000h
CWG2CLK_CS_SIZE                          equ 0001h
CWG2CLK_CS_LENGTH                        equ 0001h
CWG2CLK_CS_MASK                          equ 0001h
CWG2CLK_CWG2CS_POSN                      equ 0000h
CWG2CLK_CWG2CS_POSITION                  equ 0000h
CWG2CLK_CWG2CS_SIZE                      equ 0001h
CWG2CLK_CWG2CS_LENGTH                    equ 0001h
CWG2CLK_CWG2CS_MASK                      equ 0001h

// Register: CWG2ISM
#define CWG2ISM CWG2ISM
CWG2ISM                                  equ 03F4Ah
// bitfield definitions
CWG2ISM_ISM_POSN                         equ 0000h
CWG2ISM_ISM_POSITION                     equ 0000h
CWG2ISM_ISM_SIZE                         equ 0008h
CWG2ISM_ISM_LENGTH                       equ 0008h
CWG2ISM_ISM_MASK                         equ 00FFh
CWG2ISM_CWG2ISM_POSN                     equ 0000h
CWG2ISM_CWG2ISM_POSITION                 equ 0000h
CWG2ISM_CWG2ISM_SIZE                     equ 0008h
CWG2ISM_CWG2ISM_LENGTH                   equ 0008h
CWG2ISM_CWG2ISM_MASK                     equ 00FFh
CWG2ISM_ISM0_POSN                        equ 0000h
CWG2ISM_ISM0_POSITION                    equ 0000h
CWG2ISM_ISM0_SIZE                        equ 0001h
CWG2ISM_ISM0_LENGTH                      equ 0001h
CWG2ISM_ISM0_MASK                        equ 0001h
CWG2ISM_ISM1_POSN                        equ 0001h
CWG2ISM_ISM1_POSITION                    equ 0001h
CWG2ISM_ISM1_SIZE                        equ 0001h
CWG2ISM_ISM1_LENGTH                      equ 0001h
CWG2ISM_ISM1_MASK                        equ 0002h
CWG2ISM_ISM2_POSN                        equ 0002h
CWG2ISM_ISM2_POSITION                    equ 0002h
CWG2ISM_ISM2_SIZE                        equ 0001h
CWG2ISM_ISM2_LENGTH                      equ 0001h
CWG2ISM_ISM2_MASK                        equ 0004h
CWG2ISM_ISM3_POSN                        equ 0003h
CWG2ISM_ISM3_POSITION                    equ 0003h
CWG2ISM_ISM3_SIZE                        equ 0001h
CWG2ISM_ISM3_LENGTH                      equ 0001h
CWG2ISM_ISM3_MASK                        equ 0008h
CWG2ISM_ISM4_POSN                        equ 0004h
CWG2ISM_ISM4_POSITION                    equ 0004h
CWG2ISM_ISM4_SIZE                        equ 0001h
CWG2ISM_ISM4_LENGTH                      equ 0001h
CWG2ISM_ISM4_MASK                        equ 0010h

// Register: CWG2DBR
#define CWG2DBR CWG2DBR
CWG2DBR                                  equ 03F4Bh
// bitfield definitions
CWG2DBR_DBR_POSN                         equ 0000h
CWG2DBR_DBR_POSITION                     equ 0000h
CWG2DBR_DBR_SIZE                         equ 0008h
CWG2DBR_DBR_LENGTH                       equ 0008h
CWG2DBR_DBR_MASK                         equ 00FFh
CWG2DBR_DBR0_POSN                        equ 0000h
CWG2DBR_DBR0_POSITION                    equ 0000h
CWG2DBR_DBR0_SIZE                        equ 0001h
CWG2DBR_DBR0_LENGTH                      equ 0001h
CWG2DBR_DBR0_MASK                        equ 0001h
CWG2DBR_DBR1_POSN                        equ 0001h
CWG2DBR_DBR1_POSITION                    equ 0001h
CWG2DBR_DBR1_SIZE                        equ 0001h
CWG2DBR_DBR1_LENGTH                      equ 0001h
CWG2DBR_DBR1_MASK                        equ 0002h
CWG2DBR_DBR2_POSN                        equ 0002h
CWG2DBR_DBR2_POSITION                    equ 0002h
CWG2DBR_DBR2_SIZE                        equ 0001h
CWG2DBR_DBR2_LENGTH                      equ 0001h
CWG2DBR_DBR2_MASK                        equ 0004h
CWG2DBR_DBR3_POSN                        equ 0003h
CWG2DBR_DBR3_POSITION                    equ 0003h
CWG2DBR_DBR3_SIZE                        equ 0001h
CWG2DBR_DBR3_LENGTH                      equ 0001h
CWG2DBR_DBR3_MASK                        equ 0008h
CWG2DBR_DBR4_POSN                        equ 0004h
CWG2DBR_DBR4_POSITION                    equ 0004h
CWG2DBR_DBR4_SIZE                        equ 0001h
CWG2DBR_DBR4_LENGTH                      equ 0001h
CWG2DBR_DBR4_MASK                        equ 0010h
CWG2DBR_DBR5_POSN                        equ 0005h
CWG2DBR_DBR5_POSITION                    equ 0005h
CWG2DBR_DBR5_SIZE                        equ 0001h
CWG2DBR_DBR5_LENGTH                      equ 0001h
CWG2DBR_DBR5_MASK                        equ 0020h
CWG2DBR_CWG2DBR_POSN                     equ 0000h
CWG2DBR_CWG2DBR_POSITION                 equ 0000h
CWG2DBR_CWG2DBR_SIZE                     equ 0008h
CWG2DBR_CWG2DBR_LENGTH                   equ 0008h
CWG2DBR_CWG2DBR_MASK                     equ 00FFh
CWG2DBR_CWG2DBR0_POSN                    equ 0000h
CWG2DBR_CWG2DBR0_POSITION                equ 0000h
CWG2DBR_CWG2DBR0_SIZE                    equ 0001h
CWG2DBR_CWG2DBR0_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR0_MASK                    equ 0001h
CWG2DBR_CWG2DBR1_POSN                    equ 0001h
CWG2DBR_CWG2DBR1_POSITION                equ 0001h
CWG2DBR_CWG2DBR1_SIZE                    equ 0001h
CWG2DBR_CWG2DBR1_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR1_MASK                    equ 0002h
CWG2DBR_CWG2DBR2_POSN                    equ 0002h
CWG2DBR_CWG2DBR2_POSITION                equ 0002h
CWG2DBR_CWG2DBR2_SIZE                    equ 0001h
CWG2DBR_CWG2DBR2_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR2_MASK                    equ 0004h
CWG2DBR_CWG2DBR3_POSN                    equ 0003h
CWG2DBR_CWG2DBR3_POSITION                equ 0003h
CWG2DBR_CWG2DBR3_SIZE                    equ 0001h
CWG2DBR_CWG2DBR3_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR3_MASK                    equ 0008h
CWG2DBR_CWG2DBR4_POSN                    equ 0004h
CWG2DBR_CWG2DBR4_POSITION                equ 0004h
CWG2DBR_CWG2DBR4_SIZE                    equ 0001h
CWG2DBR_CWG2DBR4_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR4_MASK                    equ 0010h
CWG2DBR_CWG2DBR5_POSN                    equ 0005h
CWG2DBR_CWG2DBR5_POSITION                equ 0005h
CWG2DBR_CWG2DBR5_SIZE                    equ 0001h
CWG2DBR_CWG2DBR5_LENGTH                  equ 0001h
CWG2DBR_CWG2DBR5_MASK                    equ 0020h

